
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ПереводВСледующийКласс.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПереводВСледующийКласс.ГодУчебыПо,
	|	ПереводВСледующийКласс.ГодУчебыС,
	|	ПереводВСледующийКласс.Дата,
	|	ПереводВСледующийКласс.КлассНаМоментЗаписи,
	|	ПереводВСледующийКласс.Номер,
	|	ПереводВСледующийКласс.Преподаватель,
	|	ПереводВСледующийКласс.Ученики.(
	|		НомерСтроки,
	|		Ученик
	|	)
	|ИЗ
	|	Документ.ПереводВСледующийКласс КАК ПереводВСледующийКласс
	|ГДЕ
	|	ПереводВСледующийКласс.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьУченикиШапка = Макет.ПолучитьОбласть("УченикиШапка");
	ОбластьУченики = Макет.ПолучитьОбласть("Ученики");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьУченикиШапка);
		ВыборкаУченики = Выборка.Ученики.Выбрать();
		Пока ВыборкаУченики.Следующий() Цикл
			ОбластьУченики.Параметры.Заполнить(ВыборкаУченики);
			ТабДок.Вывести(ОбластьУченики, ВыборкаУченики.Уровень());
		КонецЦикла;

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
