
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Для Каждого Актив Из ТекущийОбъект.Ученики Цикл
		Ученики = Актив.Ученик.ПолучитьОбъект();
		Ученики.Класс = Объект.ВКласс;
		Ученики.Записать();   
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ИзКлассПриИзменении(Элемент)
	Объект.КлассыНаМоментЗаписи = "Из " + Объект.ИзКласса + " в " + Объект.ВКласс;
КонецПроцедуры

&НаКлиенте
Процедура ВКлассПриИзменении(Элемент)
	Объект.КлассыНаМоментЗаписи = "Из " + Объект.ИзКласса + " в " + Объект.ВКласс;
КонецПроцедуры
